/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
        "hide_title": true,
        "padding_top": 0,
        "padding_bottom": 0
      }
    },
    "use_care_guide_UGjKrx": {
      "type": "Use-Care-Guide",
      "blocks": {
        "text_cALgfc": {
          "type": "text",
          "settings": {
            "title": "You can use Kitchen Craft for any of your favorite recipes.  However once you learn how to cook using waterless, you will quickly taste the difference.",
            "details": "",
            "tips": "",
            "html": "",
            "link": ""
          }
        },
        "text_HD9JEb": {
          "type": "text",
          "settings": {
            "title": "",
            "details": "",
            "tips": "",
            "html": "<p>Waterless Cooking is easy yet unlike any other cooking method you’ve used before. We know first hand how unusual Waterless Cooking will seem at first so, to help you master it quickly, easily, and deliciously, we’ve developed a special collection of <a href=\"https://waterlesscookware.myshopify.com/pages/recipes\">recipes</a> specific to this unique way of cooking.  As counter intuitive as some of the instructions may sound, it’s very important that you follow our recipes step-by-step and word-by-word. The Kitchen Craft Test Kitchen has tested and re-tested each and every recipe and written them in a language that’s easy to understand. These few simple steps will make you a Waterless Cookware master chef in no time at all:</p>\n<p>• Follow our Waterless cooking <a href=\"https://waterlesscookware.myshopify.com/pages/recipes\">recipes</a> exactly as written to best learn the unique cooking technique</p>\n<p>• Ingredient lists and cooking times will be shorter than your accustomed to but we’ve tested and re-tested all our recipes and promise you delicious meals if you follow each recipe as written</p>\n<p>• Medium and low heat is really all you need when Waterless Cooking (Remember, most stovetops are quirky so get re-acquainted with medium and low heat on yours.)</p>\n<p>Our <a href=\"https://waterlesscookware.myshopify.com/pages/recipes\">recipes</a> will teach you to trust cooking Waterless—if the lid is spinning freely your food is cooking . </p>\n<h2><span style=\"text-decoration: underline;\">Basic Cooking Instructions to Master Waterless Cooking</span></h2>\n<h3>What Size Cookware Should I Use?</h3>\n<p>Select the right size <a href=\"https://waterlesscookware.myshopify.com/collections\">stainless steel cookware</a> – Select a cookware piece that will be at least 2/3 full with your selected food. Cooking a small quantity in a large utensil will produce inferior results and reduce energy efficient cooking. Be sure to use the cover designed to fit the utensil.</p>\n<h3>Which Burner Should I Cook On?</h3>\n<p>Use the right size burner - The diameter of your stove’s burner should be about the same as the diameter of the bottom of the cookware. If cooking on a gas range, the flame should not extend outside the flat bottom cooking surface.</p>\n<h3>Do I Need to Cook with Water?</h3>\n<p>When using the Waterless Cooking method, use little or no water - Fresh vegetables and fruit contain enough natural moisture to cook without adding water. Simply place them in your Kitchen Craft Cookware and cover with cold water, then pour off quickly. The moisture that clings to the food is enough for cooking (though some vegetables, dried fruits and cereals lacking sufficient moisture may require a small amount of added water). Meats can be cooked in their own natural juices. When cold meat is placed in a preheated pan it will stick at first, but as the meat browns and fat is released, the meat will loosen. Add liquid or oil only if specified in the recipe. When preparing a food whose fat or moisture does not liquefy in heat, such as eggs, a small amount of cooking oil or butter may be necessary to prevent sticking.</p>\n<h3>How Do I Know If Is Working? </h3>\n<p>Forming the seal - Place your food in the correct size Kitchen Craft Cookware utensil, cover and place on a burner over medium heat. In about 3 - 5 minutes Steam will begin to escape from beneath the cover. Give the cover a spin and turn the heat to LOW. If it spins freely, a seal has formed, do not remove the lid at this time. After a few minutes vapor will no longer escape and the proper cooking temperature will be reached. If steams continues to escape, the heat setting is too high; reduce to the lowest setting. If the cover locks on the pan, the heat setting is too low; increase heat slightly to loosen the cover. Since temperature settings vary from one range to another, a day or two of practice will tell you which heat settings are right for waterless cooking. </p>\n<h3>At What Temperature Should I Cook?</h3>\n<p>Use low or moderate cooking temperatures – Kitchen Craft Cookware requires only medium and low heat. Always begin cooking over medium heat, then once the seal is achieved, reduce to low for the remainder of the cooking period. High heat will cause moisture to be driven out of the pan. This will prevent the seal from forming and may result in shrinking, sticking and burning.</p>\n<h3>Should I Leave the Cover on During Cooking?</h3>\n<p>When using the Waterless Cooking method, avoid lifting the cover during cooking to retain heat and moisture. Doing so will break the seal and lengthen cooking times. Remove the cover only near the end of the cooking cycle to examine for doneness. If food has not finished cooking, quickly add 1 or 2 tablespoons of water and reset heat to medium. When steam escapes from the cover, spin the cover to check for a seal, then reduce heat to low for the remaining cooking time.</p>\n<h3>Can I Bake Using Vapor Technology?</h3>\n<p><strong>On the stovetop:</strong> Another convenience of this Stainless Steel Waterless Cookware is that cakes and breads may be baked on top of the range. Preheat well-greased skillet or saucepan over low heat for 3 to 4 minutes. Quickly pour your batter into the correct-size, Kitchen Craft Cookware utensil. Cover, reduce heat to the lowest setting and bake for the standard time indicated in the recipe (slight adjustments to baking times may be necessary). To remove excess moisture from food, tilt the cover during the last 5 to 10 minutes of baking.</p>\n<p><br><strong>In the oven: </strong>Kitchen Craft Cookware is safe for oven use up to 350 degrees. </p>\n<p>  </p>\n<h2><span style=\"text-decoration: underline;\">Care and Cleaning Instructions for Your Waterless Cookware.</span></h2>\n<p>As with any new stainless steel cookware set, always wash before first use.</p>\n<p><strong>Clean after every use </strong></p>\n<p>Wash your cookware in warm soapy water with a sponge, dishcloth or plastic pad. </p>\n<p><strong>Removing heat tints and food stains</strong></p>\n<p>Gold brown or blue heat tints may result from persistent overheating and/or mineral residue. (Sulfur-dried fruits should be cooked with the cover removed to prevent staining.) To clean, make a paste with water and a non-abrasive stainless steel cleaner such as our <a href=\"https://waterlesscookware.myshopify.com/collections/accessories/products/stainless-steel-cleanser\">Stainless Steel Cleaner</a>. If you do not have our cleaner, you can simply use baking soda. DO NOT USE A CLEANER THAT CONTAINS CHLORINE BLEACH. Apply paste with a sponge or cloth to cookware while it is still warm and rub lightly in one direction. Wash again, rinse and dry. <a href=\"https://cdn.shopify.com/s/files/1/0317/1457/4471/files/Heat_Tint_guide_pdf.pdf?v=1584028666\">Click here to see a Heat Tint Guide. </a></p>\n<p><strong>Removing minor scratches</strong></p>\n<p>During the first few times of use, bright metal marks may appear on the inside of stainless steel cookware. Remove with a non-abrasive stainless steel cleaner following the steps above. Avoid hitting metal kitchen tools against the rims of stainless cookware, and do not cut or chop foods against the stainless steel surface. Any metal will scratch if gouged.</p>\n<p><strong>Special tips for using salt </strong></p>\n<p>Although stainless steel is very durable, it is not indestructible. Pitting may result if un-dissolved salt is allowed to remain in the bottom of a pan. Do not allow acidic foods or foods that have been seasoned to remain in your Kitchen Craft Cookware for long periods of time.</p>\n<p><strong>Feel free to call us or email us if you have any questions. </strong><br><strong>Email: <a href=\"mailto:CustomerService@Cookforlife.com\">CustomerService@Cookforlife.com</a></strong><br><strong>Phone Number: <a href=\"tel:+18008002850\">(800) 800-2850</a></strong></p>",
            "link": ""
          }
        }
      },
      "block_order": [
        "text_cALgfc",
        "text_HD9JEb"
      ],
      "settings": {
        "title": "Use and Care Guide",
        "padding_top": 36,
        "padding_bottom": 36
      }
    }
  },
  "order": [
    "main",
    "use_care_guide_UGjKrx"
  ]
}
