{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"hide_title":true,"padding_top":0,"padding_bottom":0}},"lifetime_warranty_airNUz":{"type":"Lifetime-warranty","blocks":{"text_9VB7fH":{"type":"text","settings":{"title":"360 Cookware & Bakeware Products Warranty Policy:","details":"<p class=\"section-para\">This is the last cookware you’ll ever have to buy. Your 360 Cookware is warrantied\n                against defects in workmanship and materials for the lifetime of your cooking products. Please note that\n                this warranty does not cover normal wear and tear, misuse, or failure to follow care instructions. <\/p>\n            <p class=\"section-para\">All electrical components are warranted for 2 years as well as our stainless steel\n                mixing bowls and kitchen cutter. Our white mixing bowl is not covered under warranty. <\/p>\n            <p class=\"section-para\">The original purchase will be registered in our database as proof of purchase. Any\n                heir to the cookware\n                must provide a copy of the original purchase for replacement.<\/p>\n            <p class=\"section-para\">If your 360 Cookware is damaged or destroyed by fire, abuse, accident, theft, or\n                natural disaster, all original purchases may be replaced at 50% of the retail price at the time of\n                replacement. A police\/fire report, or a letter explaining the accident, must be submitted<\/p>\n            <p class=\"section-para\">Americraft Cookware’s liability under this warranty is limited to the repair or\n                replacement of the defective product at the manufacturer’s sole option. Americraft Cookware shall not be\n                liable for any incidental or consequential damages, whether direct or indirect. This warranty is\n                expressly granted in lieu of all other warranties including the implied warranties of merchantability\n                and fitness for a particular purpose.<\/p>"}},"text_tRgDGY":{"type":"text","settings":{"title":"Liberty Tabletop Products Warranty Policy:","details":"<p class=\"section-para\">25 year Manufacturer’s Warranty. Liberty Tabletop flatware offers an extension of\n                the Manufacturer’s warranty against manufacturing defects for 25 years from purchase. Simply return any\n                defective article with proof of purchase to the address below. Liberty Tabletop will thereupon send you\n                a replacement piece or a similar replacement piece in the event that your pattern has been discontinued.\n            <\/p>\n            <p class=\"section-para\">Liberty Tabletop flatware is designed for normal dining use and is dishwasher safe\n                using standard retail dishwashing detergents. This warranty does not cover damage due to inappropriate\n                use, abuse, stains due to hard water or improper care. If you have any questions regarding returns due\n                to warranty related issues please contact us using the contact information provided on our website.<\/p>"}},"text_QGKE9L":{"type":"text","settings":{"title":"Epicurean Products Warranty Policy:","details":"<p class=\"section-para\">All wooden cooking utensils, trivet, cutting board and Hex Tool Rest are\n                manufactured by Epicurean. Your Epicurean product is made to meet your complete satisfaction. Your\n                product is warranted to be free from defects in material and workmanship for the lifetime of the\n                product. Please note that this warranty does not cover normal wear and tear, misuse, or failure to\n                follow care instructions.<\/p>"}},"text_ccigiz":{"type":"text","settings":{"title":"Customer Care","details":"<p class=\"section-para\">360 Cookware is backed by the best Customer Service Departments in the industry. We\n                pride ourselves on providing comprehensive and dependable service. Please direct all customer care and\n                warranty questions and issues to:<\/p>\n            <p class=\"section-para\">360 Cookware Customer Service Department<br>\n152 E. 3rd Avenue, Mount Dora, FL, 32757<br>\nPhone: 877-360-8276<\/p>\n<p class=\"section-para\">Thank you for inviting 360 Cookware into your home to share a liftetime of meals and quality cooking experiences with you and your family. Cookware purchased from this website is already\n                registered. <b>If you've purchased your cookware at a retailer OTHER THAN 360 Cookware, please follow\n                    these steps before you begin:<\/b><\/p>\n            <ol>\n                <li>Fill out the form below to register your cookware and activate your lifetime warranty.<\/li>\n                <li>Next, click the button on the right to download the PDF document for quick and easy access to use\n                    and care tips, basic recipes and cooking times for some of your favorite meal staples.<\/li>\n                <li>After submitting the form, you will be directed to our Video Library where you can watch our collection of videos to learn techniques, tutorials and recipes specially designed for 360 Cookware.\n                <\/li>\n            <\/ol>\n            <p class=\"section-para\">Once you've followed these three easy steps, you'll be ready to experience the 360\n                Cookware difference. Enjoy!<\/p>"}}},"block_order":["text_9VB7fH","text_tRgDGY","text_QGKE9L","text_ccigiz"],"settings":{"title":"Lifetime Warranty","padding_top":36,"padding_bottom":36}},"register_form_life_time_warranty_GeA3Q4":{"type":"register-form-life-time-warranty","settings":{"title":"Register your cookware and activate your lifetime warranty","form_url":"","padding_top":36,"padding_bottom":36}}},"order":["main","lifetime_warranty_airNUz","register_form_life_time_warranty_GeA3Q4"]}