{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"hide_title":true,"padding_top":0,"padding_bottom":0}},"use_care_guide_UGjKrx":{"type":"Use-Care-Guide","blocks":{"text_cALgfc":{"type":"text","settings":{"title":"Introduction","details":"<p class=\"section-para\">Congratulations! Your investment in quality stainless steel Vapor® Cookware will\n            prove beneficial for years to come. Your cookware has been masterfully manufactured in America by\n            skilled craftsmen and women who are heirs to the cookware manufacturing process that began over a\n            century ago in West Bend, Wisconsin. This guide will help you get started with one of the best\n            investments you’ll ever make for your family’s health. Rest assured you can use all of your current\n            recipes, however, with a few slight alterations, you’ll begin to prepare delicious meals using little or\n            no fat or sodium. For optimal results, read through this guide before you get started with your new\n            cookware.<\/p>","tips":"","html":"","link":""}},"text_HD9JEb":{"type":"text","settings":{"title":"What is Vapor® Cooking?","details":"<p class=\"section-para\">Vapor Cooking is a revolutionary cooking method that will radically change not just\n            the way you cook food, but also how it tastes. Our specially designed cookware lets you create\n            delicious, intensely flavorful, naturally vitamin- and mineral-rich meals undiluted by water or doused\n            in oil, butter or other fat- and sodium-laden ingredients. With 360 Cookware, meals practically cook\n            themselves, using less energy and fewer ingredients than with traditional cooking methods. But make no\n            mistake —Vapor Cooking isn’t a diet, it’s a lifestyle. Our recipes and cooking techniques will teach you\n            to cook any and all types of foods - including baked goods - right on your stove top, using little or no\n            water or added fat. No more limp, overcooked vegetables or bland, dry meats. Vegetables are so vibrant\n            and flavorful that kids and die-hard carnivores alike will be clamoring for more; chicken, meats, and\n            fish are succulent enough to melt in your mouth. <\/p>","image":"shopify:\/\/shop_images\/8-removebg-preview_1.png","tips":"Multi-Ply Construction provides superior heat conductivity, distribution and retention. High quality stainless steel inside and out ensures easy clean up, durability and lasting beauty","html":"","link":""}},"text_NFRePR":{"type":"text","settings":{"title":"","details":"<p class=\"section-para\">The secrets to Vapor Cooking lie in the multi-ply construction and unique shape of\n            our cookware. Each piece is crafted from multiple layers of highest quality, American made metals,\n            beginning with a bonded core comprised of aluminum. The core provides superior heat conductivity and\n            retention and is sandwiched between an interior and exterior layer of T-316 and T-400 surgical stainless\n            steel creating cookware that is as durable and easy to clean as it is beautiful. The cookware is so heat\n            responsive that you cook only over medium heat, or lower — and in some cases, over no heat at all.<\/p>\n        <p class=\"section-para\">Another key to Vapor Cooking is the Vapor Seal. The Vapor Seal locks in moisture,\n            flavor, and nutrients as opposed to traditional cookware, which allows them to escape out of the pan or\n            into the cooking liquid. Vapor Cooking uses the natural moisture content of foods as its cooking instead\n            of added water and\/or fat. Our multi-ply construction allows for heat even enough to enable this\n            moisture release without scorching. The moisture — or vapor — then collects under the domed lid and\n            circulates back down and around the food, bringing with it all of the flavor, and more of the healthful\n            benefits to you and your family.<\/p>","tips":"","html":"","link":""}},"text_UUWwdb":{"type":"text","settings":{"title":"Knowing When It’s Hot Enough","details":"<p class=\"section-para\">Many of our recipes call for pre-heating your pans. This is particularly important\n            when cooking chicken,\n            meats and fish as they are usually seared in a hot, dry pan without any kind of cooking fat. However,\n            without anything melting or spluttering away in there it can be tricky to know just when it’s hot\n            enough. We find a few drops of water to be the perfect indicator: set the empty pan over medium heat for\n            3 to 5 minutes, then flick in some water with your fingertips. If the droplets bead up and roll across\n            the pan’s surface you’re ready to proceed with cooking. If the water sizzles away slowly, it’s not hot\n            enough. Continue heating the pan, then test again with water droplets.<\/p>","image":"shopify:\/\/shop_images\/9_1.png","tips":"To gauge your cookware’s heat level, drip water droplets into the heated utensil.\n            When the water beads up and rolls across the surface, the pan is at the correct temperature to begin\n            cooking.","html":"","link":""}},"text_hF4JgK":{"type":"text","settings":{"title":"Forming the Vapor Seal","details":"<p class=\"section-para\">Forming a proper Vapor Seal is key to successful Vapor Cooking. Once the lid is in\n            place, it’s virtually impossible not to reach the Vapor Seal stage. However, there’s more to it than\n            just plunking down the lid. It’s important to read and follow our recipes carefully. They have been\n            specially developed and written to teach you the Vapor Cooking method and are loaded with lots of\n            helpful tips on engaging and relying on the Vapor Seal during cooking.To gauge your cookware’s heat\n            level, drip water droplets into the heated utensil. When the water beads up and rolls across the\n            surface, the pan is at the correct temperature to begin cooking. With the lid on, foods will begin to\n            release their natural moisture and condensation will form between the lid and pan. Once you see steam\n            beginning to escape, give the lid a spin — it should do so freely, and almost float. Then, reduce the\n            heat to low — or in some cases, remove the pan from the heat altogether — and proceed with the recipe.\n            Try to resist the urge to lift the lid frequently by following the cooking times and other clues listed\n            in the recipes. It may seem strange at first not seeing or hearing foods cook. But, when properly\n            engaged, the Vapor Seal is a clear indicator that your food is cooking. It helps to be patient and cook\n            methodically until you get the hang of it — which won’t take long. Vapor Cooking will soon become second\n            nature.<\/p>","image":"shopify:\/\/shop_images\/9_1_1.png","tips":"","html":"","link":""}},"text_3Aw4aw":{"type":"text","settings":{"title":"Size Matters","details":"<p class=\"section-para\">For the best results, fill your pots and pans at least two-thirds full with food. An\n            insufficiently filled pan won’t generate enough vapor to form a proper Vapor Seal. Always match up the\n            lids and pans or you wont be able to achieve a proper Vapor Seal. In addition, use the proper size range\n            element. The diameter of the range cooking element should correspond to the diameter of the utensil. If\n            you are cooking on a gas range, the flame should not extend up the sides of the utensil.<\/p>","tips":"","html":"","link":""}},"text_Ydgqpn":{"type":"text","settings":{"title":"Use & Care","details":"<h3 class=\"\">Wash Before Use<\/h3>\n        <p class=\"section-para\">Before using your cookware for the first time, we recommend washing it in hot, soapy\n            water. Cookware manufactured by Americraft is dishwasher and oven safe. Stainless steel is durable and\n            easy to clean, and we find hot water and a soapy sponge or a non-abrasive, nylon, scouring pad is\n            usually sufficient.<\/p>\n\n        <h3 class=\"\">Removing Stuck-on Food<\/h3>\n        <p class=\"section-para\">For stubborn, stuck-on foods we recommend making a paste of ordinary baking soda or\n            your favorite eco-friendly, non-abrasive scouring powder mixed with just enough hot water to form a\n            gritty paste. Gently work the paste over the food stains with a sponge or nonabrasive, scouring pad\n            until the debris is removed. Rinse completely with hot water. Or, for truly tough jobs try “degrading”\n            the pan much the way you would during cooking. Add enough water to the empty pan to cover the stuck-on\n            foods. Bring to a boil over medium heat, and gently stir up all the bits with a wooden spoon. Discard\n            the water then wash in hot, soapy water.<\/p>\n\n        <h3 class=\"\">Removing Stains and Scratches<\/h3>\n        <p class=\"section-para\">White or light-colored stains are due to mineral deposits from certain foods. Our\n            scouring powder\/paste tip is the best way to remove them. Minor scratches can be removed using stainless\n            steel cleanser. Americraft has an excellent Stainless Steel & Aluminum Cleaner available for purchase on\n            their website. Visit www.AmericraftCookware. com to order. For best results, follow product\n            instructions.<\/p>\n        <h3 class=\"\">Use Low or Moderate Cooking Temperatures<\/h3>\n        <p class=\"section-para\">To ensure the success of minimum moisture cooking, it is important that only medium\n            and low heat be used. Always begin cooking over medium heat, and then reduce to low for remainder of the\n            cooking period. High heat will cause moisture to be driven out of the cookware preventing the water seal\n            from forming and resulting in shrinkage, sticking and burning of foods. Electric range owners, remember\n            that burners retain heat longer, therefore it may be necessary to remove the utensil until vapor\n            subsides. Gas range owners, remember to turn the flame down.<\/p>\n        <h3 class=\"\">Varying Cook Tops<\/h3>\n        <p class=\"section-para\">Though you may need to get reacquainted with your range as it relates to heat\n            settings, 360 Cookware can be used on ANY kind of cook top — gas, electric, induction and ceramic ranges\n            work perfectly. As long as the heat source is kept to a moderate or minimum temperature, any type of\n            range will work just fine.<\/p>\n        <h3 class=\"\">Oven Cooking<\/h3>\n        <p class=\"section-para\">Oven temperatures up to 350 degrees Fahrenheit (177 degrees Celsius) will not damage\n            the phenolic handles and cover knobs on our CLASSIC cookware line if the broiler unit is not on. The\n            direct heat from the broiler unit in a gas or electric oven will cause the handles and knobs to blister.\n            Before placing a utensil in the oven, make certain the oven is completely preheated. During the\n            preheating period the oven temperature may exceed 350 degrees. 360 Cookware® can withstand oven\n            temperatures up to 400 degrees Fahrenheit (204 degrees Celsius).<\/p>\n        <h3 class=\"\">Avoid Lifting Cover While Food is Cooking<\/h3>\n        <p class=\"section-para\">Lifting the cover means breaking the Vapor Seal. Cooking time will be lengthened\n            considerably each time this happens. Lift the cover just enough to insert a fork to see if food is\n            sufficiently cooked. If food is not completely cooked, replace the cover and turn heat up to medium for\n            about a minute to reform the Vapor Seal. If the pan is dry, add 1 to 2 tablespoons of water before\n            reforming the Vapor Seal. Reset to low and continue cooking.<\/p>\n        <h3 class=\"\">Tips for Using Salt<\/h3>\n        <p class=\"section-para\">Although stainless steel is very durable, it is not indestructible. Pitting may\n            result if undissolved salt is allowed to remain in the bottom of the unit. This pitting takes the form\n            of small white spots that may appear. These spots do not affect the performance of the cookware, nor are\n            they a defect in the metal or workmanship. If salt is needed, add to boiling liquid in the unit, then\n            stir to completely dissolve. Do not allow acidic foods or foods that have been seasoned to remain in\n            utensils for long periods of time.<\/p>\n        <h3 class=\"\">Clean After Every Use<\/h3>\n        <p class=\"section-para\">To maintain the attractive appearance and cooking efficiency of the cookware, it is\n            important that it be cleaned thoroughly after each use. Food films left on the cooking surface will\n            cause discoloration when the utensil is reheated.<\/p>","tips":"","html":"","link":""}},"text_NnNmEA":{"type":"text","settings":{"title":"Vapor Cooking Exceptions","details":"<p class=\"section-para\">You will love the versatility of your new cookware. You can still cook all of your\n            old recipes the way you always have. As your 360 Cookware becomes your cookware of choice, you will find\n            that there are some foods that require traditional cooking methods as well as foods that can be prepared\n            in a way you never thought possible. We’ve listed a few below:<\/p>","image":"shopify:\/\/shop_images\/9_1_2.png","tips":"","html":"","link":""}},"text_nA3i7a":{"type":"text","settings":{"title":"","details":"<h3 class=\"\">Frying an egg<\/h3>\n        <p class=\"section-para\">When frying an egg, you will need to preheat your empty skillet on medium-low. After\n            preheating, add butter, oil or cooking spray and fry as usual.<\/p>\n\n        <h3 class=\"\">Boil an egg without water<\/h3>\n        <p class=\"section-para\">Place a wet paper towel in the bottom of small pan. Insert eggs and place the lid\n            on the unit. Cook on medium heat until a water seal is formed and the lid spins, then turn to low. Cook\n            for 13 to 15 minutes on low for hard eggs, 7 to 8 minutes for medium and 5 minutes for soft (never lift\n            cover). Pour cold water over eggs, leave a bit of water and remove the paper towel. With the cover on,\n            shake the eggs to crack the shells. Peel and serve. NOTE: No green ring on yoke!<\/p>\n        <h3 class=\"\">Rice<\/h3>\n        <p class=\"section-para\">Pour 1 3\/4 cups of water and 1 cup of rice into unit - no need to bring water to a\n            boil first. Place the unit on medium heat and cover. When you see vapor escaping from under the lid,\n            turn to low and cook for 8 minutes and remove the unit from heat. Let it stand covered for 25-30\n            minutes. The rice will not over cook.<\/p>\n        <h3 class=\"\">Beans and Pasta<\/h3>\n        <p class=\"section-para\">You can cook beans and pasta just like you always have, but in 30% less time - on\n            medium to low heat. NOTE: Beans and Pasta have no moisture, so you must add water. Do not worry about\n            soaking the beans all night. It is not necessary with your new cookware.<\/p>\n        <h3 class=\"\">Pancakes, Hashbrowns and French Toast<\/h3>\n        <p class=\"section-para\">Pre-heat the pan and check to see if it’s hot enough by sprinkling with water\n            droplets. Spray the pan with a non-stick vegetable spray or use a little butter. Place the items in the\n            pan and prepare as usual.<\/p>","tips":"","html":"","link":""}},"text_UCnn3y":{"type":"text","settings":{"title":"","details":"","tips":"","html":"<h1 class=\"main-heading heading-font\">Cooking Vegetables<\/h1>\n        <h2 class=\"section-heading\">Fresh Vegetables<\/h2>\n        <p class=\"section-para\">Place the vegetables in the pot. Cover with cold water then drain. (Do not add any\n            water or liquid to the pot.) Cover the pot and cook over medium heat until steam just begins to escape\n            from under the lid. Spin the lid to engage the water seal then immediately reduce the heat to low.\n            Follow the cooking times listed on the following pages for each type of vegetable.\n        <\/p>\n        <h3 class=\"\">Frying an egg<\/h3>\n        <p class=\"section-para\">When frying an egg, you will need to preheat your empty skillet on medium-low. After\n            preheating, add butter, oil or cooking spray and fry as usual.\n        <\/p>\n\n        <div class=\"table-container-1\">\n            <table>\n                <thead>\n                    <tr>\n                        <th>Fresh Vegetables<\/th>\n                        <th>Crisp - Tender<\/th>\n                        <th>Soft<\/th>\n                    <\/tr>\n                <\/thead>\n                <tbody>\n                    <tr>\n                        <td>Asparagus (medium)<\/td>\n                        <td>5 min.<\/td>\n                        <td>8 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Asparagus (thick)<\/td>\n                        <td>6 to 7 min.<\/td>\n                        <td>8 to 10 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Beans (green, string, wax)<\/td>\n                        <td>5 min.<\/td>\n                        <td>about 8 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Beets (cubed or sliced)<\/td>\n                        <td>about 10 min.<\/td>\n                        <td>12 to 15 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Beets, medium (whole)<\/td>\n                        <td>about 20 min.<\/td>\n                        <td>25 to 30 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Broccoli (florets)<\/td>\n                        <td>about 5 min.<\/td>\n                        <td>8 to 10 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Brussel Sprouts (whole)<\/td>\n                        <td>8 min.<\/td>\n                        <td>12 to 15 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Brussel Sprouts (halved)<\/td>\n                        <td>about 6 min.<\/td>\n                        <td>10 to 12 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Carrots (baby, chopped, sliced, sticks)<\/td>\n                        <td>about 6 min.<\/td>\n                        <td>8 to 12 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Corn (kernels)<\/td>\n                        <td>4 min.<\/td>\n                        <td>about 6 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Onions (whole baby, pearl)<\/td>\n                        <td>10 to 12 min.<\/td>\n                        <td>about 15 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Parsnips (chopped, sliced, sticks)<\/td>\n                        <td>about 6 min.<\/td>\n                        <td>8 to 12 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Parsnips (whole)<\/td>\n                        <td>about 10 min.<\/td>\n                        <td>12 to 20 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Peas<\/td>\n                        <td>3 to 5 min.<\/td>\n                        <td>5 to 8 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Rutabaga (cubed)<\/td>\n                        <td>10 to 12 min.<\/td>\n                        <td>12 to 15 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Spinach<\/td>\n                        <td>about 3 min.<\/td>\n                        <td>3 to 5 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Squash, summer (cubed, sliced)<\/td>\n                        <td>3 to 5 min.<\/td>\n                        <td>5 to 7 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Squash, hard (cubed)<\/td>\n                        <td>12 to 15 min.<\/td>\n                        <td>15 to 20 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Sweet Potatoes (cubed, quartered)<\/td>\n                        <td>8 to 10 min.<\/td>\n                        <td>10 to 15 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Turnips (whole, small)<\/td>\n                        <td>15 to 20 min.<\/td>\n                        <td>20 to 25 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Yams (cubed, quartered)<\/td>\n                        <td>8 to 10 min.<\/td>\n                        <td>10 to 15 min.<\/td>\n                    <\/tr>\n                    <tr>\n                        <td>Zucchini (cubed, sliced)<\/td>\n                        <td>3 to 5 min.<\/td>\n                        <td>3 to 5 min.<\/td>\n                    <\/tr>\n                <\/tbody>\n            <\/table>\n            <p class=\"section-para\">Cauliflower and corn don’t release their natural moisture as quickly as other\n                vegetables so you will\n                need to line the pot with a few clean outer leaves or husks. Place the cauliflower or corn on top of\n                them, cover with water, then drain and proceed cooking using the times below. (If leaves or husks\n                are not available, line the pot with moist, folded paper towel.)<\/p>\n            <div class=\"table-container-2\">\n                <table>\n                    <thead>\n                        <tr>\n                            <th>Fresh Vegetables<\/th>\n                            <th>Crisp - Tender<\/th>\n                            <th>Soft<\/th>\n                        <\/tr>\n                    <\/thead>\n                    <tbody>\n                        <tr>\n                            <td>Cauliflower (florets) <\/td>\n                            <td>5 to 8 min.<\/td>\n                            <td>8 to 10 min.<\/td>\n                        <\/tr>\n                        <tr>\n                            <td>Cauliflower (whole head)<\/td>\n                            <td>20 to 30 min. <\/td>\n                            <td>about 35 min.<\/td>\n                        <\/tr>\n                        <tr>\n                            <td>Corn on the Cob<\/td>\n                            <td>about 8 min.<\/td>\n                            <td>10 to 12 min.<\/td>\n                        <\/tr>\n                    <\/tbody>\n                <\/table>\n\n                <p class=\"section-para\">Potatoes release lots of gummy starch during cooking so you will need to\n                    line the pot with a few sheets of paper towel to absorb it. Cover with water, then drain and\n                    proceed cooking using the times listed below.<\/p>\n                <div class=\"table-container-3\">\n                    <table>\n                        <tbody>\n                            <tr>\n                                <td>Potatoes, small (halved)<\/td>\n                                <td>15 to 20 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Potatoes, small (whole)<\/td>\n                                <td>15 to 20 min<\/td>\n                           <\/tr>\n                            <tr>\n                                <td>Potatoes, white (cubed, quartered)<\/td>\n                                <td>8 to 15 min.<\/td>\n                            <\/tr>\n                        <\/tbody>\n                    <\/table>\n                <\/div>\n                <h3>Frozen Vegetables<\/h3>\n                <p class=\"section-para\">Individually quick-frozen (IQF) vegetables’ quality and condition are far\n                    superior to those frozen in solid blocks. IQF vegetables and fruits usually come frozen in bags\n                    and should feel loose in the package. Frozen vegetables may contain more water than fresh and\n                    therefore may require straining before serving. Place frozen vegetables in the pot. Cover with\n                    cold water then drain. Cover the pot and cook over medium heat until steam just begins to escape\n                    from under the lid. Spin the lid to engage the Vapor Seal then immediately reduce the heat to\n                    low. Follow the cooking times listed below for each type of vegetable.<\/p>\n                <div class=\"table-container-4\">\n                    <table>\n                        <tbody>\n                            <tr>\n                                <th>Fresh Vegetables<\/th>\n                                <th>Crisp - Tender<\/th>\n                                <th>Soft<\/th>\n                            <\/tr>\n                            <tr>\n                                <td>Broccoli<\/td>\n                                <td>5 min<\/td>\n                                <td>about 7 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Carrots<\/td>\n                                <td>5 min<\/td>\n                                <td>about 8 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Cauliflower<\/td>\n                                <td>5 min<\/td>\n                                <td>about 8 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Corn (kernels)<\/td>\n                                <td>2 min<\/td>\n                                <td>about 4 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Edamame (shelled)<\/td>\n                                <td>2 min<\/td>\n                                <td>about 4 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Edamame (in pods)<\/td>\n                                <td>2 min<\/td>\n                                <td>about 5 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Green Beans<\/td>\n                                <td>5 min<\/td>\n                                <td>about 8 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Lima Beans<\/td>\n                                <td>10 to 12 min<\/td>\n                                <td>about 18 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Mixed Vegetables (depends on combination)<\/td>\n                                <td>5 min<\/td>\n                                <td>about 7 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Peas<\/td>\n                                <td>5 min<\/td>\n                                <td>about 8 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Pearl Onions<\/td>\n                                <td>10 min<\/td>\n                                <td>about 13 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Spinach<\/td>\n                                <td>5 min<\/td>\n                                <td>about 7 min.<\/td>\n                            <\/tr>\n                        <\/tbody>\n                    <\/table>\n                <\/div>\n\n<\/div>\n<\/div>","link":""}},"text_9gwzFe":{"type":"text","settings":{"title":"Cooking Poultry","details":"<p class=\"section-para\">Use the utensil that will best fit the amount of chicken you’re preparing\n                    and pre-heat over medium about 2 minutes — until it’s hot enough for water droplets to bead and\n                    dance across the surface.<\/p>\n                <p class=\"section-para\">We welcome your feedback on the accessibility of 360 Cookware Web Store.\n                    Please\n                    let\n                    us know if you encounter\n                    accessibility barriers on 360 Cookware Web Store:<\/p>\n                <h3>Type: Skin-on, bone-in breasts, legs or thighs<\/h3>\n                <p class=\"section-para\">Pre-heat the pan according to the instructions above. Place the chicken\n                    skin-side down in the hot, dry pot, and cook until the chicken comes away from the bottom of the\n                    pan with no resistance, and the skin is nicely browned. Turn the chicken, cover and cook over\n                    medium heat until steam just begins to escape from under the lid, 3 to 5 minutes. Spin the lid\n                    to engage the Vapor Seal then immediately reduce the heat to low. Cook for 15 to 20 minutes, or\n                    until the juices run clear.<\/p>\n                <h3>Type: Whole Chicken<\/h3>\n                <p class=\"section-para\">Pre-heat the pan according to the instructions above. Place the chicken\n                    breast-side down in the hot, dry pot, and cook until the chicken comes away from the bottom of\n                    the pan with no resistance, and the skin is nicely browned. Turn the chicken breast-side up.\n                    Cover and cook over medium heat until steam just begins to escape from under the lid, about 5\n                    minutes. Spin the lid to engage the Vapor Seal then immediately reduce the heat to low. Cook for\n                    50 to 60 minutes, or until the juices run clear.<\/p>","image":"shopify:\/\/shop_images\/9_1_3.png","tips":"Chicken in a Pot prepared in the 4 Quart Stock Pot","html":"","link":""}},"text_CbgNqb":{"type":"text","settings":{"title":"Cooking Meat","details":"<p class=\"section-para\">The quality of the meat and the tenderness of the cut are the two factors\n                    that determine the cooking method to be used in meat preparation. All cuts, regardless of the\n                    cooking method, should be cooked at medium to low temperatures.<\/p>\n                <p class=\"section-para\">360 Cookware Web Store is not supported with:<\/p>\n                <h3>Braising<\/h3>\n                <p class=\"section-para\">Less tender cuts of meat may be braised. Some tender cuts may also be braised\n                    such as pork steaks and cutlets, pork liver, veal chops, steaks and cutlets<\/p>\n                <ol>\n                    <li>Preheat unit over medium heat. Heat for two to four minutes and then test with a few drops of\n                        water sprinkled on the cooking surface. If the water scatters or dances, the unit is hot enough\n                        to place the meat in. <\/li>\n                    <li>Place meat in unit. The meat will stick to the pan at first, but as soon as it browns it will\n                        loosen. Sear one side then turn and brown the other. <\/li>\n                    <li>Cover unit. When a water seal is formed and the lid spins, reduce heat to low. Cook\n                        sufficiently.<\/li>\n                    <li>Vegetables may be added if desired. Be sure to coordinate cooking time of the vegetables with\n                        that of the meat.<\/li>\n                <\/ol>\n                <h3>Simmering and Stewing<\/h3>\n                <p class=\"section-para\">Large, less tender cuts of meat such as beef brisket, veal, lamb and variety of\n                    meats such as heart, kidney and tongue are prepared by simmering. Leave meat in one piece unless it\n                    is very large, then cut in half. Stewing is much the same as simmering, except that the meat is cut\n                    into small uniform pieces, usually 1- to 2-inch cubes<\/p>\n                <ol>\n                    <li>Preheat unit over medium heat. Place meat in unit and brown well on both sides. <\/li>\n                    <li>Season meat with salt, pepper, herbs and spices, as desired. Add amount of liquid specified in\n                        recipe but not more than 1 to 1 1\/2 cups. <\/li>\n                    <li>Cover unit and cook over medium heat until a water seal is formed and the lid spins, then reduce\n                        heat to low. Simmer; do not boil, over low heat until the meat is done. <\/li>\n                    <li>Vegetables may be added if desired. Be sure to coordinate cooking time of vegetables with that\n                        of the meat.<\/li>\n                <\/ol>\n                <h3>Roasting<\/h3>\n                <p class=\"section-para\">Meat becomes juicy and flavorful when roasted on top of the range. Select chunky\n                    cuts of beef, veal, pork or lamb and use unit suitable for size and shape of roast.<\/p>\n                <ol>\n                    <li>Preheat unit over medium heat. Brown meat evenly on both sides and season to taste. Do not add\n                        water.<\/li>\n                    <li>Cover unit. When a water seal is formed and the lid spins, reduce heat to low. Cook\n                        sufficiently.<\/li>\n                    <li>Vegetables may be added if desired. Gravy may be made from juices that accumulate.<\/li>\n\n                <\/ol>\n                <h3>Pan Broiling<\/h3>\n                <p class=\"section-para\">Tender cuts of meat that are one-inch thick or less such as beef steak, beef\n                    patties, ham slices and lamb chops, may be pan broiled with no shortening or liquid in a skillet on\n                    top of the range.<\/p>\n                <ol>\n                    <li>Fat on meat may be removed or scored at 1-inch intervals to prevent curling. Do not cut or pound\n                        tender cuts of meat, as juices will be lost.<\/li>\n                    <li>Preheat unit over medium heat, then place meat in utensil. Meat will stick. Do not cover or add\n                        shortening or liquid.<\/li>\n                    <li>Sear meat until it can be removed from utensil. Turn meat and brown, then reduce heat to low and\n                        cook sufficiently. Pour off fat as it accumulates<\/li>\n                    <li>Season to taste. Serve at once.<\/li>\n                <\/ol>","tips":"","html":"<div class=\"table-container-2\">\n                    <table>\n                        <thead>\n                            <tr>\n                                <th>Fresh Vegetables<\/th>\n                                <th>Crisp - Tender<\/th>\n                                <th>Soft<\/th>\n                            <\/tr>\n                        <\/thead>\n                        <tbody>\n                            <tr>\n                                <td>Cauliflower (florets) <\/td>\n                                <td>5 to 8 min.<\/td>\n                                <td>8 to 10 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Cauliflower (whole head)<\/td>\n                                <td>20 to 30 min. <\/td>\n                                <td>about 35 min.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Corn on the Cob<\/td>\n                                <td>about 8 min.<\/td>\n                                <td>10 to 12 min.<\/td>\n                            <\/tr>\n                        <\/tbody>\n                    <\/table>\n                  <\/div>\n\n                    <p class=\"section-para\">Potatoes release lots of gummy starch during cooking so you will need to\n                        line the pot with a few sheets of paper towel to absorb it. Cover with water, then drain and\n                        proceed cooking using the times listed below.<\/p>\n                    <div class=\"table-container-3\">\n                        <table>\n                            <tbody>\n                                <tr>\n                                    <td>Potatoes, small (halved)<\/td>\n                                    <td>15 to 20 min.<\/td>\n                                <\/tr>\n                                <tr>\n                                    <td>Potatoes, small (whole)<\/td>\n                                    <td>15 to 20 min<\/td>\n                                <\/tr>\n                                <tr>\n                                    <td>Potatoes, white (cubed, quartered)<\/td>\n                                    <td>8 to 15 min.<\/td>\n                                <\/tr>\n                            <\/tbody>\n                        <\/table>\n                    <\/div>\n  <h3>Frozen Vegetables<\/h3>\n                    <p class=\"section-para\">Individually quick-frozen (IQF) vegetables’ quality and condition are far\n                        superior to those frozen in solid blocks. IQF vegetables and fruits usually come frozen in bags\n                        and should feel loose in the package. Frozen vegetables may contain more water than fresh and\n                        therefore may require straining before serving. Place frozen vegetables in the pot. Cover with\n                        cold water then drain. Cover the pot and cook over medium heat until steam just begins to escape\n                        from under the lid. Spin the lid to engage the Vapor Seal then immediately reduce the heat to\n                        low. Follow the cooking times listed below for each type of vegetable.<\/p>\n                    <div class=\"table-container-4\">\n                        <table>\n                            <tbody>\n                                <tr>\n                                    <th>Meat<\/th>\n                                    <th>Cut<\/th>\n                                    <th>Approx. cooking time (min\/side)<\/th>\n                                <\/tr>\n                                <tr>\n                                    <td>Club or Rib Steaks<\/td>\n                                    <td>3\/4-inch thick<\/td>\n                                    <td>2 min. - Rare <br>\n                                        3 min. - Medium <br>\n                                        4 min. - Well<\/td>\n                                <\/tr>\n                                <tr>\n                                    <td>Minute Steak<\/td>\n                                    <td>Less than 1-inch thick<\/td>\n                                    <td>2 min<\/td>\n                                <\/tr>\n                                <tr>\n                                    <td>Ham Steaks<\/td>\n                                    <td>1\/2-inch thick<\/td>\n                                    <td>5 min.<\/td>\n                                <\/tr>\n                                <tr>\n                                    <td>Lamb Chops<\/td>\n                                    <td>3\/4-inch thick<\/td>\n                                    <td>5 to 6 min<\/td>\n                                <\/tr>\n                                <tr>\n                                    <td>Pork Chops<\/td>\n                                    <td>3\/4-inch thick<\/td>\n                                    <td>7 min.<\/td>\n                                <\/tr>\n                                <tr>\n                                    <td>Veal Chops<\/td>\n                                    <td>3\/4-inch thick<\/td>\n                                    <td>8 to 10 min<\/td>\n                                <\/tr>\n                                <tr>\n                                    <td>Hamburgers<\/td>\n                                    <td>1\/2-inch thick<\/td>\n                                    <td>3 min. - Rare <br>\n                                        4 min. - Medium <br>\n                                        4 min. - Well<\/td>\n                                <\/tr>\n                            <\/tbody>\n                        <\/table>\n                    <\/div>","link":""}},"text_AGUFVL":{"type":"text","settings":{"title":"Cooking Fish","details":"<p class=\"section-para\">When buying fresh fish, select fish whose flesh appears moist and firm. If the\n                    cut you are buying has the skin on, it should be clear, smooth, and shiny. The fish should smell\n                    briny and slightly sweet like the sea and not at all fishy or off-putting. Store fresh fish in the\n                    coldest part of your refrigerator (usually bottom or middle shelf, in the back) and cook it the same\n                    day it’s purchased. If buying frozen fish, it should look as though it had been frozen fresh from\n                    the sea. Discard if the fish looks cloudy or murky or if there is even the slightest hint of freezer\n                    burn. Be sure to defrost frozen fish thoroughly in the refrigerator (not the microwave, which\n                    partially cooks it). Pat the fish dry with paper towels before cooking. The chart below is meant as\n                    a guideline for basic cooked fish. Create easy and delicious one-pot meals by Vapor Cooking fish on\n                    a bed of fresh, aromatic vegetables.<\/p>","tips":"","html":"<div class=\"table-container-4\">\n<table>\n                        <tbody>\n                            <tr>\n                                <th>Type of fish<\/th>\n                                <th>Cut<\/th>\n                                <th>Cooking method &amp; time<\/th>\n                            <\/tr>\n                            <tr>\n                                <td>Arctic Char, Bluefish, Catfish, Flounder, Halibut, Sole, Tilapia, Sea Bass or Trout\n                                <\/td>\n                                <td>Thin Fillets (3\/4- to 1-inch thick)<\/td>\n                                <td>Spray pan lightly with cooking spray. Season fish then place in cold pan. Cover and\n                                    place over medium heat; cook until Vapor Seal has formed. Spin lid to engage seal;\n                                    reduce heat to low then cook 1 minute. Let stand, covered, off-heat for 5 to 7\n                                    minutes until fish flakes easily and is just opaque at its thickest part.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Cod, Salmon, Snapper or Grouper<\/td>\n                                <td>Thick Fillets (1 1\/2- to 2-inches thick)<\/td>\n                                <td>Spray pan lightly with cooking spray. Season fish then place in cold pan. Cover pan\n                                    and place over medium heat; cook until Vapor Seal has formed. Spin lid to engage\n                                    seal; reduce heat to low then cook 2 minutes. Let stand, covered, off-heat for 7 to\n                                    9 minutes until fish flakes easily and is just opaque at its thickest part.<\/td>\n                            <\/tr>\n                            <tr>\n                                <td>Halibut, Salmon, Swordfish or Tuna<\/td>\n                                <td>Thick Fillets (1 1\/2- to 2-inches thick)<\/td>\n                                <td>Heat pan over medium heat until hot enough that water droplets bead across the\n                                    surface. Lightly coat pan with cooking spray. Season fish; cook uncovered for 2 to 3\n                                    minutes. Carefully turn fish. Cover and cook until Vapor Seal has formed; spin to\n                                    engage seal. Remove from heat and let stand for 5 to 8 minutes until fish flakes\n                                    easily and is just opaque at its thickest part.<\/td>\n                            <\/tr>\n                        <\/tbody>\n                    <\/table>\n<\/div>","link":""}},"text_iqATzF":{"type":"text","settings":{"title":"","details":"","image":"shopify:\/\/shop_images\/9_1_4.png","tips":"Tilapia with Fresh Salsa, Corn & Baby Spinach prepared in the 3.5 Quart Sauté Pan","html":"<h3>Finishing Tips for Fish<\/h3>\n                    <ul>\n                        <li>Drizzle with extra virgin olive oil, fresh lemon juice and fresh herbs <\/li>\n                        <li>Stir minced shallots, lemon juice, salt, and fresh herbs if desired into softened butter.\n                            Dot a teaspoon of the mixture over each piece of fish <\/li>\n                        <li>Dollop with homemade or prepared pesto or olive tapenade <\/li>\n                        <li>Toss diced fresh tomatoes or diced roasted peppers with minced garlic, basil, and a splash\n                            of red wine vinegar and extra virgin olive oil; season with salt and pepper. Spoon over\n                            cooked fish <\/li>\n                        <li>Drizzle with homemade or bottled vinaigrette (microwave refrigerated vinaigrette in a\n                            microwave safe bowl for a few seconds to get rid of the chill) <\/li>\n                        <li>Drizzle with lemony hollandaise sauce <\/li>\n                        <li>Drizzle with your favorite Asian or Southwestern marinade<\/li>\n                    <\/ul>","link":""}},"text_TNRwnk":{"type":"text","settings":{"title":"Stovetop Baking","details":"<p class=\"section-para\">Top of the range baking is economical and convenient. The uniform heat\n                    distribution of your cookware turns the pans into small “ovens”.<\/p>\n                <ol>\n                    <li>Prepare the skillet and cover by spraying with a light coating of vegetable cooking spray. Place\n                        a circle of waxed paper, cut to fit on the bottom.<\/li>\n                    <li>Pour the mixed batter into the skillet and cover<\/li>\n                    <li>Continue baking at low heat until nearly done - about 15 to 20 minutes. Remove the cover to test\n                        for doneness. Wipe away any excess moisture on the cover; then replace the cover. Do this about\n                        every 5 minutes until a toothpick inserted in the center of the cake or bread comes out clean,\n                        indicating the food is done. You may find that slight adjustments need to be made in the baking.\n                    <\/li>\n                    <li>When the cake or bread is fully baked, remove the skillet from the heat and allow to cool in the\n                        pan for a few minutes. Carefully run a knife around the edge. Invert the pan over a cooling rack\n                        until the cake or bread comes out of the skillet.<\/li>\n                    <\/ol>","image":"shopify:\/\/shop_images\/9_1_5.png","tips":"Pumpkin Bread prepared in the 2.3 Quart Casserole.","html":"","link":""}},"text_qHXPBy":{"type":"text","settings":{"title":"Troubleshooting & FAQs","details":"","tips":"","html":"<div class=\"Troubleshooting-heading-border-bottom\">\n                    <h3>The Issue<\/h3>\n                    <p class=\"section-para\">The lid won’t come off the pot; got stuck on the countertop.<\/p>\n                    <h3>The Reason<\/h3>\n                    <p class=\"section-para\">As the pans and lids cool, a vacuum will form rendering the lid immovable.\n                    <\/p>\n                    <h3>The Fix<\/h3>\n                    <p class=\"section-para\">Simply place the pan over medium heat for a few minutes. The lid will lift\n                        off once the metals have warmed. <\/p>\n                    <p class=\"section-para\">Should your lid get stuck on your countertop or other surface, soak a dish\n                        towel in hot water, wring out excess water and place the dish towel over the lid. The heat from\n                        the damp towel should be sufficient to remove the lid from any flat surface. When cooking, be\n                        mindful to not let the lid sit on any flat surface.<\/p>\n                <\/div>\n                <div class=\"Troubleshooting-heading-border-bottom\">\n                    <h3>The Issue<\/h3>\n                    <p class=\"section-para\">Excessive steam and spattering during cooking; liquid is pooling around the\n                        lid.<\/p>\n                    <h3>The Reason<\/h3>\n                    <p class=\"section-para\">Heat is too high; too much food in the pot\n                    <\/p>\n                    <h3>The Fix<\/h3>\n                    <p class=\"section-para\">Remember to reduce the heat to low as soon as you see steam begin to escape\n                        from under the lid. If your burners run hot no matter how low you go, try using a Flame-Tamer\n                        which are available at many department stores. Be sure the utensils are no more than two-thirds\n                        full.<\/p>\n\n                <\/div>\n                <div class=\"Troubleshooting-heading-border-bottom\">\n                    <h3>The Issue<\/h3>\n                    <p class=\"section-para\">I can’t get the Vapor Seal to form; the lid isn’t floating freely during\n                        cooking.<\/p>\n                    <h3>The Reason<\/h3>\n                    <p class=\"section-para\">Heat is too low (or off) or the pot is too large for the amount of food;\n                        vapors haven’t been fully released by foods.\n                    <\/p>\n                    <h3>The Fix<\/h3>\n                    <p class=\"section-para\">Increase the heat to medium to re-engage the Vapor Seal then try cooking\n                        over medium-low. Be sure pot is at least two-thirds full.<\/p>\n\n                <\/div>\n                <div class=\"Troubleshooting-heading-border-bottom\">\n                    <h3>The Issue<\/h3>\n                    <p class=\"section-para\">Foods burn or stick to the pot; cooking vapors boil away during cooking;\n                        persistent stains, blue tint or discoloration on the inside or outside of cookware.<\/p>\n                    <h3>The Reason<\/h3>\n                    <p class=\"section-para\">Heat is too high or the lid is lifted too frequently during cooking.\n                    <\/p>\n                    <h3>The Fix<\/h3>\n                    <p class=\"section-para\">Remember to only heat cookware over medium heat (unless otherwise specified)\n                        and to reduce the heat to low once the Vapor Seal has formed. Discoloration is due to persistent\n                        overheating. Use one of our recommended cleaners and cleaning methods to remove stains.<\/p>\n                <\/div>","link":""}},"text_B8GCWi":{"type":"text","settings":{"title":"Lifetime Warranty","details":"<p class=\"section-para\">The cookware you’ve invested in is warranted against defects in workmanship and\n                    materials for the lifetime of the cookware. All electrical components are warranted for 2 years. The\n                    original purchase will be registered in our database as proof of purchase. Any heir to the cookware\n                    must provide a copy of the original purchase for replacement. <\/p>\n                <p class=\"section-para\">If your cookware is damaged or destroyed by fire, abuse, accident, theft, or\n                    natural disaster, all original purchases may be replaced at 50% of the retail price at the time of\n                    replacement. A police\/fire report, or a letter explaining the accident, must be submitted. <\/p>\n                <p class=\"section-para\">The manufacturer’s liability under this warranty is limited to the repair or\n                    replacement of the defective product at the manufacturer’s sole option. The manufacturer shall not\n                    be liable for any incidental or consequential damages, whether direct or indirect. This warranty is\n                    expressly granted in lieu of all other warranties including the implied warranties of\n                    merchantability and fitness for a particular purpose.<\/p>\n                <h3>All warranty issues should be directed to: <\/h3>\n                <p class=\"section-para\">Americraft Cookware Customer Service Department <br>\n                    Phone: 877-335-7267 | Fax: 888-592-3295 <br>\n                    <a href=\"https:\/\/americraftcookware.com\/\" target=\"_blank\">www.AmericraftCookware.com<\/a><\/p>","tips":"","html":"","link":""}}},"block_order":["text_cALgfc","text_HD9JEb","text_NFRePR","text_UUWwdb","text_hF4JgK","text_3Aw4aw","text_Ydgqpn","text_NnNmEA","text_nA3i7a","text_UCnn3y","text_9gwzFe","text_CbgNqb","text_AGUFVL","text_iqATzF","text_TNRwnk","text_qHXPBy","text_B8GCWi"],"settings":{"title":"Use and Care Guide","padding_top":36,"padding_bottom":36}}},"order":["main","use_care_guide_UGjKrx"]}